## Atlantis Self-Deploy 🔄

**Status:** Changes detected

<details><summary>📋 Terraform Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_service.atlantis will be updated in-place
  ~ resource "aws_ecs_service" "atlantis" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/atlantis-prod/atlantis-prod"
        name                               = "atlantis-prod"
        tags                               = {
            "Component"   = "atlantis"
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS service for Atlantis Terraform automation server"
            "Environment" = "prod"
            "Lifecycle"   = "permanent"
            "ManagedBy"   = "terraform"
            "Name"        = "atlantis-prod"
            "Owner"       = "platform-team"
            "Project"     = "infrastructure"
            "Service"     = "atlantis"
            "Team"        = "platform-team"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:11" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.atlantis will be created
  + resource "aws_ecs_task_definition" "atlantis" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "ATLANTIS_ATLANTIS_URL"
                          + value = "https://atlantis.set-of.com"
                        },
                      + {
                          + name  = "ATLANTIS_LOG_LEVEL"
                          + value = "debug"
                        },
                      + {
                          + name  = "ATLANTIS_PORT"
                          + value = "4141"
                        },
                      + {
                          + name  = "ATLANTIS_REPO_ALLOWLIST"
                          + value = "github.com/ryu-qqq/*"
                        },
                      + {
                          + name  = "ATLANTIS_REPO_CONFIG"
                          + value = "/home/atlantis/repos.yaml"
                        },
                      + {
                          + name  = "ATLANTIS_WRITE_GIT_CREDS"
                          + value = "true"
                        },
                    ]
                  + essential        = true
                  + healthCheck      = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:4141/healthz || exit 1",
                        ]
                      + interval    = 30
                      + retries     = 3
                      + startPeriod = 60
                      + timeout     = 5
                    }
                  + image            = "646886795421.dkr.ecr.ap-northeast-2.amazonaws.com/atlantis:v0.30.0"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/atlantis-prod/application"
                          + awslogs-region        = "ap-northeast-2"
                          + awslogs-stream-prefix = "atlantis"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/home/atlantis/.atlantis"
                          + readOnly      = false
                          + sourceVolume  = "atlantis-data"
                        },
                    ]
                  + name             = "atlantis"
                  + portMappings     = [
                      + {
                          + containerPort = 4141
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "ATLANTIS_GH_APP_ID"
                          + valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:app_id::"
                        },
                      + {
                          + name      = "ATLANTIS_GH_APP_INSTALLATION_ID"
                          + valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:installation_id::"
                        },
                      + {
                          + name      = "ATLANTIS_GH_APP_KEY"
                          + valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/github-app-v2-prod-oxfqDt:private_key::"
                        },
                      + {
                          + name      = "ATLANTIS_GH_WEBHOOK_SECRET"
                          + valueFrom = "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:atlantis/webhook-secret-v2-prod-JSD4P7:webhook_secret::"
                        },
                    ]
                  + ulimits          = [
                      + {
                          + hardLimit = 65536
                          + name      = "nofile"
                          + softLimit = 65536
                        },
                    ]
                },
            ]
        )
      + cpu                      = "2048"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::646886795421:role/atlantis-ecs-task-execution-prod"
      + family                   = "atlantis-prod"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task definition for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      + tags_all                 = {
          + "Component"   = "atlantis"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "ECS task definition for Atlantis Terraform automation server"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "atlantis-prod"
          + "Owner"       = "platform-team"
          + "Project"     = "infrastructure"
          + "Service"     = "atlantis"
          + "Team"        = "platform-team"
        }
      + task_role_arn            = "arn:aws:iam::646886795421:role/atlantis-ecs-task-prod"
      + track_latest             = false

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "atlantis-data"

          + efs_volume_configuration {
              + file_system_id          = "fs-0404558fae26deb97"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2049

              + authorization_config {
                  + access_point_id = "fsap-015fe847f3b144192"
                  + iam             = "ENABLED"
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ atlantis_task_definition_arn         = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/atlantis-prod:11" -> (known after apply)
  ~ atlantis_task_definition_revision    = 11 -> (known after apply)

```

</details>

---
⚠️ **Note:** This PR modifies Atlantis infrastructure. Changes will be auto-applied on merge to main.

*Pushed by: @ryu-qqq*